Revit 2026 API

# RebarGetCrankRatio Method

---

Gets the crank ratio at the indicated bar end.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetCrankRatio(
	int end
)
```
```vb
Public Function GetCrankRatio (
	end As Integer
) As Double
```
```cpp
public:
double GetCrankRatio(
	int end
)
```
```fsharp
member GetCrankRatio :
        end : int -> float
```

#### Parameters

end Int32
     The bar end.

#### Return Value

Double Returns the crank ratio.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |
| InvalidOperationException | The bar does not have a valid Rebar Crank Type at the end. |

The crank slope is 1/crankRatio. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace